Osuga/TivaC/TEST_CLOCK/boards.txt
######################################################
# LM4F120H5QR 80MHz
#	with launchpad
######################################################
lplm4f120h5qr.name=StellarPad w/ lm4f120h5qr (80MHz)
lplm4f120h5qr.upload.maximum_size=262144
lplm4f120h5qr.build.mcu=cortex-m4
lplm4f120h5qr.build.f_cpu=80000000L
lplm4f120h5qr.build.core=lm4f
lplm4f120h5qr.build.variant=stellarpad
lplm4f120h5qr.ldscript=lm4fcpp.ld


######################################################
# LM4F120H5QR 16MHz
#	with launchpad
######################################################
lplm4f-120-1.name=StellarPad w/ lm4f120h5QR (16MHz)
lplm4f-120-1.upload.maximum_size=262144
lplm4f-120-1.build.mcu=cortex-m4
lplm4f-120-1.build.f_cpu=16000000L
lplm4f-120-1.build.core=lm4f
lplm4f-120-1.build.variant=stellarpad
lplm4f-120-1.ldscript=lm4fcpp.ld

######################################################
# Tiva C TM4C1233H6PM 80MHz
#	with launchpad
######################################################
lpTivaC-80.name=Tiva C w/ TM4C1233H6PM (80MHz)
lpTivaC-80.upload.maximum_size=262144
lpTivaC-80.build.mcu=cortex-m4
lpTivaC-80.build.f_cpu=80000000L
lpTivaC-80.build.core=lm4f
lpTivaC-80.build.variant=stellarpad
lpTivaC-80.ldscript=lm4fcpp.ld

######################################################
# Tiva C TM4C1233H6PM 25MHz
#	with launchpad
######################################################
lpTivaC-25.name=Tiva C w/ TM4C1233H6PM (25MHz)
lpTivaC-25.upload.maximum_size=262144
lpTivaC-25.build.mcu=cortex-m4
lpTivaC-25.build.f_cpu=25000000L
lpTivaC-25.build.core=lm4f
lpTivaC-25.build.variant=stellarpad
lpTivaC-25.ldscript=lm4fcpp.ld

######################################################
# Tiva C TM4C1233H6PM 16MHz
#	with launchpad
######################################################
lpTivaC-16.name=Tiva C w/ TM4C1233H6PM (16MHz)
lpTivaC-16.upload.maximum_size=262144
lpTivaC-16.build.mcu=cortex-m4
lpTivaC-16.build.f_cpu=16000000L
lpTivaC-16.build.core=lm4f
lpTivaC-16.build.variant=stellarpad
lpTivaC-16.ldscript=lm4fcpp.ld

######################################################
# Tiva C TM4C1233H6PM 50MHz
#	with launchpad
######################################################
lpTivaC-50.name=Tiva C w/ TM4C1233H6PM (50MHz)
lpTivaC-50.upload.maximum_size=262144
lpTivaC-50.build.mcu=cortex-m4
lpTivaC-50.build.f_cpu=50000000L
lpTivaC-50.build.core=lm4f
lpTivaC-50.build.variant=stellarpad
lpTivaC-50.ldscript=lm4fcpp.ld

######################################################
# Tiva C TM4C1233H6PM 16MHz 
#	with launchpad
######################################################
lpTivaC-16a.name=Tiva C w/ TM4C1233H6PM (16MHz NON-PLL)
lpTivaC-16a.upload.maximum_size=262144
lpTivaC-16a.build.mcu=cortex-m4
lpTivaC-16a.build.f_cpu=16200000L
lpTivaC-16a.build.core=lm4f
lpTivaC-16a.build.variant=stellarpad
lpTivaC-16a.ldscript=lm4fcpp.ld

######################################################
# Tiva C TM4C1233H6PM 16MHz INTERNAL OSC, NON PLL
#	with launchpad
######################################################
lpTivaC-16b.name=Tiva C w/ TM4C1233H6PM (INT 16MHz NON-PLL)
lpTivaC-16b.upload.maximum_size=262144
lpTivaC-16b.build.mcu=cortex-m4
lpTivaC-16b.build.f_cpu=16100000L
lpTivaC-16b.build.core=lm4f
lpTivaC-16b.build.variant=stellarpad
lpTivaC-16b.ldscript=lm4fcpp.ld
